import styles from "./Rules.module.scss";
import logo from "../../logo.svg";
import Footer from "../../components/footer/footer";

export default function Rules() {
    return (
        <div>
            <div className={styles.rules}>
                <img src={logo} alt={"logo icon"} />

                <h3>قوانین و مقررات</h3>
                    <header>
                        با استفاده از وب‌سایت کرم کتاب، شما موافقت خود را با رعایت قوانین و
                        مقررات زیر اعلام می‌کنید. لطفاً پیش از استفاده از خدمات، این شرایط
                        را به دقت مطالعه نمایید.
                    </header>
                    <ol>
                        <li>
                            مقدمه
                            <ul className={styles.li}>
                                این قوانین و مقررات شرایط استفاده از وب‌سایت کرم کتاب و
                                خدمات ارائه‌شده در آن را تعیین می‌کنند. استفاده از سایت به منزله‌ی
                                پذیرش کامل این شرایط محسوب می‌شود.
                            </ul>

                        </li>
                        <li>
                            استفاده از خدمات
                            <ul>
                                <li>
                                    ثبت‌نام و ورود: کاربران موظفند اطلاعات صحیح و به‌روز خود را
                                    هنگام ثبت‌نام وارد نمایند. هرگونه ارائه اطلاعات نادرست ممکن
                                    است منجر به تعلیق حساب کاربری گردد.
                                </li>
                                <li>
                                    محتوا: تمامی مطالب و نظرات منتشر شده در سایت تحت نظارت تیم کرم
                                    کتاب قرار دارند و کاربران باید از انتشار مطالب توهین‌آمیز یا
                                    غیرقانونی خودداری نمایند.
                                </li>
                            </ul>
                        </li>

                        <li>

                            حقوق مالکیت فکری
                            <ul className={styles.li}>
                                تمامی محتوا، از جمله متن‌ها، تصاویر، لوگو و سایر المان‌های
                                بصری وب‌سایت کرم کتاب، متعلق به شرکت می‌باشد. هرگونه استفاده بدون
                                اجازه کتبی از این محتوا ممنوع است.
                            </ul>

                        </li>

                        <li>
                            مسئولیت‌های کاربران
                            <ul>
                                <li>
                                    کاربران موظفند از خدمات سایت به نحو صحیح و قانونی استفاده
                                    نمایند.
                                </li>
                                <li>
                                    کاربران مسئول حفظ امنیت اطلاعات ورود به حساب کاربری خود هستند
                                    و در صورت مشاهده هرگونه فعالیت مشکوک، باید فوراً به پشتیبانی
                                    اطلاع دهند.
                                </li>
                            </ul>
                        </li>
                        <li>
                            محدودیت‌های مسئولیت
                            <ul className={styles.li}>
                                    کرم کتاب در قبال خطاهای فنی، اختلالات سیستم یا خسارات ناشی از
                                    استفاده‌ی نادرست کاربران، مسئولیتی نخواهد داشت. استفاده از خدمات
                                    به عهده‌ی خود کاربر است.
                            </ul>
                        </li>
                        <li>
                            تغییرات در قوانین
                            <ul className={styles.li}>
                                کرم کتاب حق تغییر، اصلاح یا به‌روزرسانی این قوانین و مقررات را
                                بدون اعلام قبلی دارد. ادامه استفاده از سایت به منزله‌ی پذیرش نسخه
                                به‌روز شده این قوانین محسوب می‌شود.
                            </ul>
                        </li>
                        <li>
                            حل اختلاف
                            <ul className={styles.li}>
                                در صورت بروز هرگونه اختلاف، ابتدا تلاش خواهد شد تا از طریق مذاکرات
                                دوستانه راه‌حل پیدا شود. در صورت عدم توافق، موضوع به مراجع قضایی
                                ارجاع خواهد شد.
                            </ul>
                            <br/>
                            <br/>
                        </li>
                    </ol>
            </div>

            <div>
                <Footer />
            </div>
        </div>
    );
}
